--DELETE FROM douban_groups
--WHERE group_id = 753780

------------------------------------------------------------------------
INSERT INTO douban_groups(group_id, group_name, group_who, max_page)
VALUES
(742550,'有趣读书旅店','李兰迪',5),
(754923,'萌物研究所','李兰迪',37),
(756831,'呱呱乐','敖瑞鹏',32),
(741039,'快到盆里来','敖瑞鹏',11),
(709596,'豆瓣花草丛生组','丁禹兮',137),
(757800,'喝茶喝水喝牛奶','丁禹兮',36),
(745115,'叶片飞船','丁禹兮',30),
(740469,'脆脆鲨饼王','田曦薇',36),
(750426,'我有老公你有什么','田曦薇',17),
(740777,'Haribo糖果屋','张婧仪',26),
(746401,'野生游乐园','周也',55),
(751658,'煎蛋不翻车联盟','赵今麦',14),
(741543,'小不忍则唛大萌','白鹿',59),
(751664,'给妮点妍色C.C','白鹿',12),
(751693,'睡个好觉','白鹿',11),
(754719,'仙女教母的魔法森林','辛迪瑞拉',44),
(752890,'兔个乐呵','陈都灵',67),
(679863,'花花世界|小花大花巨花','杨超越',121),
(741830,'茶妍悦色','赵露思',52)
ON CONFLICT (group_id) DO UPDATE SET
  group_name = EXCLUDED.group_name,
  group_who  = EXCLUDED.group_who,
  max_page   = EXCLUDED.max_page,
  updated_at = now();


INSERT INTO douban_groups(group_id, group_name, group_who, max_page)
VALUES
(742550,'有趣读书旅店','李兰迪',5)

-- 2026.02.15
INSERT INTO douban_groups(group_id, group_name, group_who, max_page)
VALUES
(750171,'五星级卷饼大酒店','田曦薇',4),
(756236,'鲨鱼夹夹你脑壳','沈羽洁',2),
(671405,'拜拜组','白鹿',4),
(747726,'等一下下卡皮巴拉','丁禹兮',11),
(752436,'上帝掷骰子吗','丁禹兮',47),
(745761,'关你什么事呢','刘浩存',12),
(740729,'冷门小动物交流中心','檀健次',29),
(748190,'阅读理解进修班','田曦薇',2),
(753780,'夏威仪风味研究所','张婧仪宋威龙',46),
(741919,'给灵魂放假','周也',4),
(741143,'养鹅防老','宋祖儿',10),
(751765,'精神下饭菜','杨紫',21),
(754069,'口袋里面有什么','任嘉伦',26)


-- 2026.02.28
INSERT INTO douban_groups(group_id, group_name, group_who, max_page)
VALUES
(750737,'狐狸饲养中心','李昀锐',64),
(752319,'LittleFox喂养经验分享','李昀锐',4),
(745129,'神奇游泳池','刘宇宁',31),
(736218,'007训练基地','张凌赫',23)

-- 2026.03.03
UPDATE douban_groups
SET max_page = 37
WHERE group_id = 754923;



