--DELETE FROM douban_groups
--WHERE group_id = 753780

------------------------------------------------------------------------
INSERT INTO douban_groups(group_id, group_name, group_who, max_page)
VALUES
(742550,'有趣读书旅店','李兰迪',5),
(754923,'萌物研究所','李兰迪',37),
(756831,'呱呱乐','敖瑞鹏',32),
(741039,'快到盆里来','敖瑞鹏',11),
(709596,'豆瓣花草丛生组','丁禹兮',137),
(757800,'喝茶喝水喝牛奶','丁禹兮',36),
(745115,'叶片飞船','丁禹兮',30),
(740469,'脆脆鲨饼王','田曦薇',36),
(750426,'我有老公你有什么','田曦薇',17),
(740777,'Haribo糖果屋','张婧仪',26),
(746401,'野生游乐园','周也',55),
(751658,'煎蛋不翻车联盟','赵今麦',14),
(741543,'小不忍则唛大萌','白鹿',59),
(751664,'给妮点妍色C.C','白鹿',12),
(751693,'睡个好觉','白鹿',11),
(754719,'仙女教母的魔法森林','辛迪瑞拉',44),
(752890,'兔个乐呵','陈都灵',67),
(679863,'花花世界|小花大花巨花','杨超越',121),
(741830,'茶妍悦色','赵露思',52)
ON CONFLICT (group_id) DO UPDATE SET
  group_name = EXCLUDED.group_name,
  group_who  = EXCLUDED.group_who,
  max_page   = EXCLUDED.max_page,
  updated_at = now();


INSERT INTO douban_groups(group_id, group_name, group_who, max_page)
VALUES
(742550,'有趣读书旅店','李兰迪',5)

-- 2026.02.15
INSERT INTO douban_groups(group_id, group_name, group_who, max_page)
VALUES
(750171,'五星级卷饼大酒店','田曦薇',4),
(756236,'鲨鱼夹夹你脑壳','沈羽洁',2),
(671405,'拜拜组','白鹿',4),
(747726,'等一下下卡皮巴拉','丁禹兮',11),
(752436,'上帝掷骰子吗','丁禹兮',47),
(745761,'关你什么事呢','刘浩存',12),
(740729,'冷门小动物交流中心','檀健次',29),
(748190,'阅读理解进修班','田曦薇',2),
(753780,'夏威仪风味研究所','张婧仪宋威龙',46),
(741919,'给灵魂放假','周也',4),
(741143,'养鹅防老','宋祖儿',10),
(751765,'精神下饭菜','杨紫',21),
(754069,'口袋里面有什么','任嘉伦',26)


-- 2026.02.28
INSERT INTO douban_groups(group_id, group_name, group_who, max_page)
VALUES
(750737,'狐狸饲养中心','李昀锐',64),
(752319,'LittleFox喂养经验分享','李昀锐',4),
(745129,'神奇游泳池','刘宇宁',31),
(736218,'007训练基地','张凌赫',23)

-- 2026.03.03
UPDATE douban_groups
SET max_page = 37
WHERE group_id = 754923;


-- 2026.03.08
INSERT INTO douban_groups(group_id, group_name, group_who, max_page)
VALUES
(741865,'流浪神仙所','卢昱晓',2),
(749799,'松弛狗保姆','卢昱晓',6),
(652850,'永寿宫','宋祖儿',37),
(754319,'薇选心事','田曦薇',4),
(744948,'散养组','王鹤棣',10),
(751902,'避风塘','王鹤棣',10),
(756167,'玄学飞升','王鹤棣',3),
(756906,'小美一枚','王影璐',5),
(754167,'日料组','吴磊',2),
(358890,'捡到钻石了','吴磊',3),
(739837,'小葵花妈妈课堂','向涵之',6),
(756905,'五千年一遇美女','徐若晗',2),
(749310,'大风有座桃花山','杨超越',9),
(707268,'Lunatic','杨超越',11),
(756932,'夹馅贝果研究所','杨超越',4),
(711843,'河马精英组','杨超越',132),
(748838,'焦糖冰豆花','章若楠',4),
(752401,'福灵剂工坊','周也',17),
(752402,'当蛋挞统治世界','周也',1),
(744550,'大家都爱鱼','虞书欣',44),
(753326,'游到海水变蓝','虞书欣',35),
(750564,'好想藏起来','虞书欣',2),
(749938,'肥肥追击队','虞书欣',21),
(750337,'完美花花养成大本营','孟子义',78),
(755685,'Phonk午夜声波公社','孟子义',4),
(749766,'我手植的第一捧花','包上恩',5),
--(738335,'笑一下蒜了','陈都灵',485),  --可能公共组，先不抓
(747746,'月球捣药基地','陈都灵',12),
(752476,'别管我了','敖瑞鹏',3),
(752375,'西梅种植园','邓恩熙',2),
(751663,'芒果奶冻西米露','邓恩熙',7),
(756478,'家长里短','代露娃',9),
(207118,'春天里的娃娃','代露娃',7),
(662572,'豆瓣笑组','鞠婧祎',45),
(748617,'江南制燥局','鞠婧祎',13),
(746354,'莴苣种植日记','鞠婧祎',4),
(739358,'二号线人多','鞠婧祎',11),
(741685,'什么都没做','李一桐',40),
(754336,'兔兔摸摸搞桐性恋','李一桐',10),
(745149,'洗头小哥','李一桐',8),
(749024,'女神日记簿','赵露思',7),
(737330,'你才是荷包蛋','赵露思',50)

-- 2026.3.11
INSERT INTO douban_groups(group_id, group_name, group_who, max_page)
VALUES
(745219,'茶嘻嘻看戏','丁禹兮',1848)

UPDATE douban_groups
SET group_who = '茶嘻嘻看戏'
WHERE group_id = 745219;


--2026.3.13
INSERT INTO douban_groups(group_id, group_name, group_who, max_page)
VALUES
(759880,'呱呱乐收藏夹','敖瑞鹏',5)
